# Manipulating DataFrames with pandas
- William Surles
- 2017-10-31
- Data camp course
- [https://www.datacamp.com/courses/manipulating-dataframes-with-pandas](https://www.datacamp.com/courses/manipulating-dataframes-with-pandas)

## Whats Covered
- Extracting and transforming data
 - Indexing DataFrames
 - Slicing DataFrames
 - Filtering DataFrames
 - Transforming DataFrames
- Advanced indexing
 - Index objects and labeled data
 - Hierarchical indexing
- Rearranging and reshaping data
 - Pivoting DataFrames
 - Stacking and ustacking Datafraes
 - Melting DataFrames
 - Pivot Tables
- Grouping data
 - Categoricals and groupby
 - Groupby and aggregation
 - Groupby and filtering
- Brining it all together
 - Case Study - Summer Olympics
 - Understanding the column labels
 - Constructing alternative county rankings
 - Reshaping DataFrames for visualization

## Aditional Resources

## Libraries and Data

In [176]:
import pandas as pd
import numpy as np
from numpy import nan
import warnings
warnings.filterwarnings('ignore')
from scipy.stats import zscore

# Extracting and transforming data

## Indexing DataFrames

#### Get the sales data

In [140]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/sales.csv'
sales = pd.read_csv(file, index_col = 'month')
sales

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### Simple indexing with square brackets
- This is similar to indexing python lists and numpy arrays

In [141]:
sales['salt']['Jan']

12.0

#### Using column attribite and row label
- column labels can be refered to as attributes of the df if the labels are valid python identifiers

In [142]:
sales.eggs['Mar']

221

#### Using the .loc accesor
- This is more efficent and more programtically reusable
- `.loc` uses labels
- `.iloc` uses index positions
- these are given as [row, column]

In [13]:
sales.loc['May','spam']

52

In [15]:
sales.iloc[4,2]

52

#### Selecting only some columns
- When using bracket indexing without .loc the value returned can be an individual value, a pandas series, or a pandas dataframe. yikes
- To ensure you get a dataframe back use double brackets `[['stuff']]` (This is a nested list)

In [143]:
sales_new = sales[['salt','eggs']]
sales_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

### Index ordering

In [24]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/pennsylvania2012_turnout.csv'
election = pd.read_csv(file, index_col = 'county')
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [25]:
election.loc['Bedford','winner']

'Romney'

### Positional and labeled indexing

In [26]:
# Assign the row position of election.loc['Bedford']: x
x = 4

# Assign the column position of election['winner']: y
y = 4

# Print the boolean equivalence
print(election.iloc[x, y] == election.loc['Bedford', 'winner'])

True

### Indexing and column rearrangement

In [28]:
# Create a separate dataframe with the columns ['winner', 'total', 'voters']: results
results = election[['winner', 'total', 'voters']]

# Print the output of results.head()
print(results.head())

           winner   total  voters
county
Adams      Romney   41973   61156
Allegheny   Obama  614671  924351
Armstrong  Romney   28322   42147
Beaver     Romney   80015  115157
Bedford    Romney   21444   32189

## Slicing DataFrames

#### Selecting a column

In [29]:
sales['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [30]:
type(sales['eggs'])

pandas.core.series.Series

#### Slicing and indexing a Series

In [32]:
sales['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [33]:
sales['eggs'][4]

132

#### Using .loc[ ]
- this can use a label range. 
- The right endpoint will be included, thankfully!

In [36]:
sales.loc[:, 'eggs':'salt']

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [37]:
sales.loc['Jan':'Apr',:]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [39]:
sales.loc['Mar':'May','salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

#### Using .iloc[ ]

In [40]:
sales.iloc[2:5, 1:]

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

#### Using lists rather than slices

In [41]:
sales.loc['Jan':'May',['eggs','spam']]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52

- Remember with `.iloc` the right endpoint is not included

In [42]:
sales.iloc[[0,4,5],0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

#### Series versus 1-column DataFrame

In [43]:
# A Series by column name
type(sales['eggs'])

pandas.core.series.Series

In [44]:
# A DataFrame w/ single column

In [45]:
type(sales[['eggs']])

pandas.core.frame.DataFrame

### Slicing rows

In [49]:
# Slice the row labels 'Perry' to 'Potter': p_counties
p_counties = election.loc['Perry':'Potter']

# Print the p_counties DataFrame
p_counties

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681

In [50]:
# Slice the row labels 'Potter' to 'Perry' in reverse order: p_counties_rev
p_counties_rev = election.loc['Potter':'Perry':-1]

# Print the p_counties_rev DataFrame
p_counties_rev

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Potter,PA,7205,26.259542,72.158223,Romney,10913,66.022175,45.898681
Pike,PA,23164,43.904334,54.882576,Romney,41840,55.363289,10.978242
Philadelphia,PA,653598,85.224251,14.051451,Obama,1099197,59.461407,71.172800
Perry,PA,18240,29.769737,68.591009,Romney,27245,66.948064,38.821272

### Slicing columns

In [51]:
# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election.loc[:,:'Obama']

# Print the output of left_columns.head()
left_columns.head()

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452

In [52]:
# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election.loc[:,'Obama':'winner']

# Print the output of middle_columns.head()
middle_columns.head()

               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney

In [53]:
# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election.loc[:,'Romney':]

# Print the output of right_columns.head()
right_columns.head()

              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

### Subselecting DataFrames with lists

In [54]:
# Create the list of row labels: rows
rows = ['Philadelphia', 'Centre', 'Fulton']

# Create the list of column labels: cols
cols = ['winner','Obama','Romney']

# Create the new DataFrame: three_counties
three_counties = election.loc[rows, cols]

# Print the three_counties DataFrame
three_counties

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

## Filtering DataFrames

#### Creating a boolean series

In [55]:
sales.salt > 60

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

#### Filtering with a boolean series
- You can filter directly with a logical expression or assing the boolean series to a variable

In [56]:
sales[sales.salt > 60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [57]:
enough_salt_sold = sales.salt > 60

sales[enough_salt_sold]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

#### Combining filters
- Parens are used to force order of logical operations

In [59]:
sales[(sales.salt >= 50) & (sales.eggs < 200)]

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [61]:
sales[(sales.salt >= 50) | (sales.eggs < 200)]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### DataFrames with zero and NaNs

In [64]:
sales2 = sales.copy()
sales2['bacon'] = [0, 0, 50, 60, 70, 80]
sales2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

#### Select columns with all nonzeros

In [66]:
sales2.loc[:, sales2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

#### Select columns with any nonzeros

In [67]:
sales2.loc[:, sales2.any()]

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

#### Select columns with any NaNs

In [68]:
sales.loc[:, sales.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

#### Select columns without NaNs

In [69]:
sales.loc[:, sales.notnull().all()]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

#### Drop rows with any NaNs

In [70]:
sales.dropna(how = 'any')

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

#### Filtering a column based on another

In [71]:
sales.eggs[sales.salt > 55]

month
Mar    221
Apr     77
Jun    205
Name: eggs, dtype: int64

#### Modifying a column based on another
- Lets say a few eggs are throw in for free with every large salt sale...

In [74]:
sales.eggs[sales.salt > 55] += 5
sales

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     231  89.0    72
Apr      87  87.0    20
May     132   NaN    52
Jun     215  60.0    55

### Thresholding data

In [75]:
election.head()

,state,total,Obama,Romney,winner,voters,turnout,margin
county,,,,,,,,
Adams,PA,41973,35.482334,63.112001,Romney,61156,68.632677,27.629667
Allegheny,PA,614671,56.640219,42.185820,Obama,924351,66.497575,14.454399
Armstrong,PA,28322,30.696985,67.901278,Romney,42147,67.198140,37.204293
Beaver,PA,80015,46.032619,52.637630,Romney,115157,69.483401,6.605012
Bedford,PA,21444,22.057452,76.986570,Romney,32189,66.619031,54.929118

In [76]:
# Create the boolean array: high_turnout
high_turnout = election.turnout > 70

# Filter the election DataFrame with the high_turnout array: high_turnout_df
high_turnout_df = election[high_turnout]

# Print the high_turnout_results DataFrame
print(high_turnout_df)

             state   total      Obama     Romney  winner  voters    turnout  \
county
Bucks           PA  319407  49.966970  48.801686   Obama  435606  73.324748
Butler          PA   88924  31.920516  66.816607  Romney  122762  72.436096
Chester         PA  248295  49.228539  49.650617  Romney  337822  73.498766
Forest          PA    2308  38.734835  59.835355  Romney    3232  71.410891
Franklin        PA   62802  30.110506  68.583803  Romney   87406  71.850903
Montgomery      PA  401787  56.637223  42.286834   Obama  551105  72.905708
Westmoreland    PA  168709  37.567646  61.306154  Romney  238006  70.884347

                 margin
county
Bucks          1.165284
Butler        34.896091
Chester        0.422079
Forest        21.100520
Franklin      38.473297
Montgomery    14.350390
Westmoreland  23.738508

### Filtering columns using other columns

In [78]:
# Create the boolean array: too_close
too_close = election.margin < 1

# Assign np.nan to the 'winner' column where the results were too close to call
election.winner[too_close] = np.nan

# Print the output of election.info()
print(election.info())

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     64 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB
None

### Filtering using NaNs
- We will use `dropna()` with 'any' and 'all' to filter the data
- We will also use `thresh=1000` to select columns with at least 1k non null values

In [88]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/titanic.csv'
titanic = pd.read_csv(file)

In [90]:
print(titanic.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.2+ KB
None

In [91]:
titanic.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [92]:
# Select the 'age' and 'cabin' columns: df
df = titanic.loc[:,['age','cabin']]

# Print the shape of df
print(df.shape)

df.head(20)

(1309, 2)

      age    cabin
0   29.00       B5
1    0.92  C22 C26
2    2.00  C22 C26
3   30.00  C22 C26
4   25.00  C22 C26
5   48.00      E12
6   63.00       D7
7   39.00      A36
8   53.00     C101
9   71.00      NaN
10  47.00  C62 C64
11  18.00  C62 C64
12  24.00      B35
13  26.00      NaN
14  80.00      A23
15    NaN      NaN
16  24.00  B58 B60
17  50.00  B58 B60
18  32.00      D15
19  36.00       C6

In [93]:
# Drop rows in df with how='any' and print the shape
print(df.dropna(how='any').shape)

(272, 2)

In [94]:
# Drop rows in df with how='all' and print the shape
print(df.dropna(how = 'all').shape)

(1069, 2)

In [95]:
# Call .dropna() with thresh=1000 and axis='columns' and print the output of .info() from titanic
print(titanic.dropna(thresh=1000, axis='columns').info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 10 columns):
pclass      1309 non-null int64
survived    1309 non-null int64
name        1309 non-null object
sex         1309 non-null object
age         1046 non-null float64
sibsp       1309 non-null int64
parch       1309 non-null int64
ticket      1309 non-null object
fare        1308 non-null float64
embarked    1307 non-null object
dtypes: float64(2), int64(4), object(4)
memory usage: 102.3+ KB
None

## Transforming DataFrames

- the best way to transform a data frame is with a pandas dataframe method
- the second best way is to use numpy universal functions (ufuncs)

#### Dataframe vectorized methods
- this will apply a function over the entire dataframe

In [97]:
sales

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     231  89.0    72
Apr      87  87.0    20
May     132   NaN    52
Jun     215  60.0    55

In [98]:
# convert count to dozens. This rounds down.
sales.floordiv(12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      19   7.0     6
Apr       7   7.0     1
May      11   NaN     4
Jun      17   5.0     4

#### NumPy vectorized functions

In [99]:
np.floor_divide(sales, 12)

       eggs  salt  spam
month
Jan     3.0   1.0   1.0
Feb     9.0   4.0   2.0
Mar    19.0   7.0   6.0
Apr     7.0   7.0   1.0
May    11.0   NaN   4.0
Jun    17.0   5.0   4.0

#### Plain python functions

In [103]:
# Reusable python function
def dozens(n):
    """Divide by 12 and round down"""
    return n//12

sales.apply(dozens)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      19   7.0     6
Apr       7   7.0     1
May      11   NaN     4
Jun      17   5.0     4

In [104]:
# throw away python function (lambda)
sales.apply(lambda n: n//12)

       eggs  salt  spam
month
Jan       3   1.0     1
Feb       9   4.0     2
Mar      19   7.0     6
Apr       7   7.0     1
May      11   NaN     4
Jun      17   5.0     4

#### Storing a transformation

In [105]:
sales['dozens_of_eggs'] = sales.eggs.floordiv(12)
sales

       eggs  salt  spam  dozens_of_eggs
month
Jan      47  12.0    17               3
Feb     110  50.0    31               9
Mar     231  89.0    72              19
Apr      87  87.0    20               7
May     132   NaN    52              11
Jun     215  60.0    55              17

#### Working with string values
- We can use the `str` method to access strings

In [106]:
sales.index = sales.index.str.upper()
sales

       eggs  salt  spam  dozens_of_eggs
month
JAN      47  12.0    17               3
FEB     110  50.0    31               9
MAR     231  89.0    72              19
APR      87  87.0    20               7
MAY     132   NaN    52              11
JUN     215  60.0    55              17

- Unfortunately when working with the index we have to use `map` rather than `apply`
- We can map a defined or a custom transformation using `map`

In [107]:
sales.index = sales.index.map(str.lower)
sales

       eggs  salt  spam  dozens_of_eggs
month
jan      47  12.0    17               3
feb     110  50.0    31               9
mar     231  89.0    72              19
apr      87  87.0    20               7
may     132   NaN    52              11
jun     215  60.0    55              17

#### Defining columns using other columns

In [109]:
sales['salty_eggs'] = sales.salt + sales.dozens_of_eggs
sales

       eggs  salt  spam  dozens_of_eggs  salty_eggs
month
jan      47  12.0    17               3        15.0
feb     110  50.0    31               9        59.0
mar     231  89.0    72              19       108.0
apr      87  87.0    20               7        94.0
may     132   NaN    52              11         NaN
jun     215  60.0    55              17        77.0

### Using apply() to transform a column

In [111]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/pittsburgh2013.csv'
weather = pd.read_csv(file)
weather.head()

,Date,Max TemperatureF,Mean TemperatureF,Min TemperatureF,Max Dew PointF,Mean Dew PointF,Min DewpointF,Max Humidity,Mean Humidity,Min Humidity,...,Max VisibilityMiles,Mean VisibilityMiles,Min VisibilityMiles,Max Wind SpeedMPH,Mean Wind SpeedMPH,Max Gust SpeedMPH,PrecipitationIn,CloudCover,Events,WindDirDegrees
0,2013-1-1,32,28,21,30,27,16,100,89,77,...,10,6,2,10,8,NaN,0.00,8,Snow,277
1,2013-1-2,25,21,17,14,12,10,77,67,55,...,10,10,10,14,5,NaN,0.00,4,NaN,272
2,2013-1-3,32,24,16,19,15,9,77,67,56,...,10,10,10,17,8,26.0,0.00,3,NaN,229
3,2013-1-4,30,28,27,21,19,17,75,68,59,...,10,10,6,23,16,32.0,0.00,4,NaN,250
4,2013-1-5,34,30,25,23,20,16,75,68,61,...,10,10,10,16,10,23.0,0.21,5,NaN,221

In [112]:
# Write a function to convert degrees Fahrenheit to degrees Celsius: to_celsius
def to_celsius(F):
    return 5/9*(F - 32)

# Apply the function over 'Mean TemperatureF' and 'Mean Dew PointF': df_celsius
df_celsius = weather[['Mean TemperatureF', 'Mean Dew PointF']].apply(to_celsius)

# Reassign the columns df_celsius
df_celsius.columns = ['Mean TemperatureC', 'Mean Dew PointC']

# Print the output of df_celsius.head()
print(df_celsius.head())

   Mean TemperatureC  Mean Dew PointC
0          -2.222222        -2.777778
1          -6.111111       -11.111111
2          -4.444444        -9.444444
3          -2.222222        -7.222222
4          -1.111111        -6.666667

### Using .map() with a dictionary
- The .map() method is used to transform values according to a Python dictionary look-up.

In [113]:
# Create the dictionary: red_vs_blue
red_vs_blue = {'Obama':'blue', 'Romney':'red'}

# Use the dictionary to map the 'winner' column to the new column: election['color']
election['color'] = election.winner.map(red_vs_blue)

# Print the output of election.head()
print(election.head())

          state   total      Obama     Romney  winner  voters    turnout  \
county
Adams        PA   41973  35.482334  63.112001  Romney   61156  68.632677
Allegheny    PA  614671  56.640219  42.185820   Obama  924351  66.497575
Armstrong    PA   28322  30.696985  67.901278  Romney   42147  67.198140
Beaver       PA   80015  46.032619  52.637630  Romney  115157  69.483401
Bedford      PA   21444  22.057452  76.986570  Romney   32189  66.619031

              margin color
county
Adams      27.629667   red
Allegheny  14.454399  blue
Armstrong  37.204293   red
Beaver      6.605012   red
Bedford    54.929118   red

### Using vectorized functions

- When performance is paramount, you should avoid using .apply() and .map() because those constructs perform Python for-loops over the data stored in a pandas Series or DataFrame. 
- By using vectorized functions instead, you can loop over the data at the same speed as compiled code (C, Fortran, etc.)! 
- NumPy, SciPy and pandas come with a variety of vectorized functions (called Universal Functions or UFuncs in NumPy).
- You can write your own vectorized functions, but here we will just focus on the ones distributed by numpy and pandas
- Instead of using `.apply()` as you did in the earlier exercises, the `zscore` UFunc will take a pandas Series as input and return a NumPy array.

In [115]:
# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election['turnout'])

# Print the type of turnout_zscore
print(type(turnout_zscore))

<class 'numpy.ndarray'>

In [116]:
# Assign turnout_zscore to a new column: election['turnout_zscore']
election['turnout_zscore'] = turnout_zscore

# Print the output of election.head()
print(election.head())

          state   total      Obama     Romney  winner  voters    turnout  \
county
Adams        PA   41973  35.482334  63.112001  Romney   61156  68.632677
Allegheny    PA  614671  56.640219  42.185820   Obama  924351  66.497575
Armstrong    PA   28322  30.696985  67.901278  Romney   42147  67.198140
Beaver       PA   80015  46.032619  52.637630  Romney  115157  69.483401
Bedford      PA   21444  22.057452  76.986570  Romney   32189  66.619031

              margin color  turnout_zscore
county
Adams      27.629667   red        0.853734
Allegheny  14.454399  blue        0.439846
Armstrong  37.204293   red        0.575650
Beaver      6.605012   red        1.018647
Bedford    54.929118   red        0.463391

# Advanced indexing

## Index objects and labeled data

#### pandas Data Structures
- Key Building blocks
 - Indexes: Sequence of labels
 - Series: 1D array with index
 - DataFrames: 2D array with Series as columns
- Indexes
 - Immutable (like ditionary keys)
 - Homogenous in data type (like numpy arrays)

#### Creating a Series

In [117]:
prices = [10.70, 10.86, 10.74, 10.71, 10.79]
shares = pd.Series(prices)
print(shares)

0    10.70
1    10.86
2    10.74
3    10.71
4    10.79
dtype: float64

#### Creating an index

In [118]:
days = ['Mon','Tues','Wed','Thurs','Fri']
shares = pd.Series(prices, index=days)
print(shares)

Mon      10.70
Tues     10.86
Wed      10.74
Thurs    10.71
Fri      10.79
dtype: float64

#### Examining an index
- We can index and slice into the index just as we can with a python list

In [119]:
print(shares.index)
print('----------------')
print(shares.index[2])
print('----------------')
print(shares.index[:2])
print('----------------')
print(shares.index[-2:])
print('----------------')
print(shares.index.name)

Index(['Mon', 'Tues', 'Wed', 'Thurs', 'Fri'], dtype='object')
----------------
Wed
----------------
Index(['Mon', 'Tues'], dtype='object')
----------------
Index(['Thurs', 'Fri'], dtype='object')
----------------
None

#### Modifying index name

In [121]:
shares.index.name = 'weekday'
print(shares)

weekday
Mon      10.70
Tues     10.86
Wed      10.74
Thurs    10.71
Fri      10.79
dtype: float64

#### Modifying index entries
- Nope, these are immutable
- This helps pandas optimize on operations

In [122]:
shares.index[2] = 'Wednesday'

TypeError: Index does not support mutable operations

In [123]:
shares.index[:4] = ['Monday','Tuesday','Wednesday','Thursday']

TypeError: Index does not support mutable operations

- But you can override the entire index all at once. 
- This will drop the index name as it is a reset basically

In [124]:
shares.index = ['Monday','Tuesday','Wednesday','Thursday','Friday']
print(shares)

Monday       10.70
Tuesday      10.86
Wednesday    10.74
Thursday     10.71
Friday       10.79
dtype: float64

#### Unemployment data
- by default we have a range index of integers

In [125]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/Unemployment.csv'
unemployment = pd.read_csv(file)
unemployment.head()

    Zip  unemployment  participants
0  1001          0.06         13801
1  1002          0.09         24551
2  1003          0.17         11477
3  1005          0.10          4086
4  1007          0.05         11362

In [126]:
unemployment.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33120 entries, 0 to 33119
Data columns (total 3 columns):
Zip             33120 non-null int64
unemployment    32556 non-null float64
participants    33120 non-null int64
dtypes: float64(1), int64(2)
memory usage: 776.3 KB

#### Assigning the index
- It makes more sense to use the zip as the index, since that is the row identifier

In [127]:
unemployment.index = unemployment['Zip']
unemployment.head()

       Zip  unemployment  participants
Zip
1001  1001          0.06         13801
1002  1002          0.09         24551
1003  1003          0.17         11477
1005  1005          0.10          4086
1007  1007          0.05         11362

In [128]:
# Now remove the redundant column using del
del unemployment['Zip']
unemployment.head(3)

      unemployment  participants
Zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477

#### Examining index & columns

In [130]:
# index details
print(unemployment.index)

Int64Index([1001, 1002, 1003, 1005, 1007, 1008, 1009, 1010, 1011, 1012,
            ...
             966,  968,  969,  971,  976,  979,  982,  983,  985,  987],
           dtype='int64', name='Zip', length=33120)

In [131]:
# index name
print(unemployment.index.name)

Zip

In [132]:
# index type
print(type(unemployment.index))

<class 'pandas.core.indexes.numeric.Int64Index'>

In [133]:
# the columns of the df are also an index
print(unemployment.columns)

Index(['unemployment', 'participants'], dtype='object')

#### read_csv() with index_col
- If you can, just set the index right from the start as you read in the df

In [134]:
unemployment = pd.read_csv(file, index_col = 'Zip')
unemployment.head()

      unemployment  participants
Zip
1001          0.06         13801
1002          0.09         24551
1003          0.17         11477
1005          0.10          4086
1007          0.05         11362

### Changing index of a DataFrame

#### get the sales data again

In [147]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/sales.csv'
sales = pd.read_csv(file, index_col = 'month')
sales

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [148]:
# Create the list of new indexes: new_idx
new_idx = [i.upper() for i in sales.index]

# Assign new_idx to sales.index
sales.index = new_idx

# Print the sales DataFrame
sales

     eggs  salt  spam
JAN    47  12.0    17
FEB   110  50.0    31
MAR   221  89.0    72
APR    77  87.0    20
MAY   132   NaN    52
JUN   205  60.0    55

### Changing index name labels

In [149]:
# Assign the string 'MONTHS' to sales.index.name
sales.index.name = 'MONTHS'

# Assign the string 'PRODUCTS' to sales.columns.name 
sales.columns.name = 'PRODUCTS'

# Print the sales dataframe again
sales

PRODUCTS  eggs  salt  spam
MONTHS
JAN         47  12.0    17
FEB        110  50.0    31
MAR        221  89.0    72
APR         77  87.0    20
MAY        132   NaN    52
JUN        205  60.0    55

### Building an index, then a DataFrame

In [155]:
# Drop the index from sales
sales.reset_index(drop=True, inplace=True)
sales.columns.name = None
sales

   eggs  salt  spam
0    47  12.0    17
1   110  50.0    31
2   221  89.0    72
3    77  87.0    20
4   132   NaN    52
5   205  60.0    55

In [156]:
# Generate the list of months: months
months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun']

# Assign months to sales.index
sales.index = months

# Print the modified sales DataFrame
sales

     eggs  salt  spam
Jan    47  12.0    17
Feb   110  50.0    31
Mar   221  89.0    72
Apr    77  87.0    20
May   132   NaN    52
Jun   205  60.0    55

## Hierarchical indexing

#### Stock Data

In [158]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/stocks.csv'
stocks = pd.read_csv(file)
stocks.head()

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT

#### Setting index
- Here it makes since to use symbol and date as the index as this uniquely identifies the rows

In [160]:
stocks = stocks.set_index(['Symbol','Date'])
stocks.head()

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900

#### MultiIndex on DataFrame
- You need to use `names` rather than `name` on a multiindex. Thats a little unfortunate I think

In [161]:
print(stocks.index)

MultiIndex(levels=[['AAPL', 'CSCO', 'MSFT'], ['2016-10-03', '2016-10-04', '2016-10-05']],
           labels=[[1, 0, 2, 0, 2, 1, 2, 1, 0], [0, 0, 0, 1, 1, 1, 2, 2, 2]],
           names=['Symbol', 'Date'])

In [162]:
print(stocks.index.name)
print(stocks.index.names)

None
['Symbol', 'Date']

#### Sorting index
- This shows data a little like a pivot table. It leaves gaps where an index value would be repeated
- Not sure how I feel about that but okay.

In [163]:
stocks = stocks.sort_index()
stocks

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

#### Indexing (individual row)

In [164]:
stocks.loc[('CSCO','2016-10-04')]

Close           31.35
Volume    18460400.00
Name: (CSCO, 2016-10-04), dtype: float64

In [165]:
stocks.loc[('CSCO','2016-10-04'), 'Volume']

18460400.0

#### Slicing (outermost index)

In [166]:
stocks.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [167]:
# Use a range of symbols
stocks.loc['CSCO':'MSFT']

                   Close    Volume
Symbol Date
CSCO   2016-10-03  31.50  14070500
       2016-10-04  31.35  18460400
       2016-10-05  31.59  11808600
MSFT   2016-10-03  57.42  19189500
       2016-10-04  57.24  20085900
       2016-10-05  57.64  16726400

#### Fancy Indexing i.e. indexing with list (outermost index)
- you use a tuple to represent the index columns and a list for the values you want from an individual column

In [168]:
stocks.loc[(['AAPL','MSFT'],'2016-10-05'),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-05  113.05  21453100
MSFT   2016-10-05   57.64  16726400

In [169]:
stocks.loc[(['AAPL','MSFT'],'2016-10-05'),'Close']

Symbol  Date
AAPL    2016-10-05    113.05
MSFT    2016-10-05     57.64
Name: Close, dtype: float64

#### Fancy indexing (innermost index)

In [171]:
stocks.loc[('CSCO', ['2016-10-05','2016-10-03']), :]

                   Close    Volume
Symbol Date
CSCO   2016-10-03  31.50  14070500
       2016-10-05  31.59  11808600

#### Slicing (both indexes)
- The tuple used for the index does not recognize the `:` natively
- So we need to use the `slice()` function to slice both indexes
- Here we grab all symbols for the dates 10-03 and 10-04

In [172]:
stocks.loc[(slice(None), slice('2016-10-03','2016-10-04')),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900

### Setting & sorting a MultiIndex

#### Make a new sales dataset with a state column

In [185]:
sales = pd.DataFrame(
[['CA', 1, 47, 12.0, 17],
 ['CA', 2, 110, 50.0, 31],
 ['NY', 1, 221, 89.0, 72],
 ['NY', 2, 77, 87.0, 20],
 ['TX', 1, 132, nan, 52],
 ['TX', 2, 205, 60.0, 55]],
columns = ['state','month','eggs','salt','spam'])

sales

  state  month  eggs  salt  spam
0    CA      1    47  12.0    17
1    CA      2   110  50.0    31
2    NY      1   221  89.0    72
3    NY      2    77  87.0    20
4    TX      1   132   NaN    52
5    TX      2   205  60.0    55

In [187]:
# Set the index to be the columns ['state', 'month']: sales
sales3 = sales.set_index(['state','month'])

sales3

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

In [189]:
# Sort the MultiIndex: sales
sales3 = sales3.sort_index()

# Print the sales DataFrame
sales3

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

### Extracting data with a MultiIndex

In [190]:
# Print sales.loc[['CA', 'TX']]
sales3.loc[['CA', 'TX']]

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
TX    1       132   NaN    52
      2       205  60.0    55

In [192]:
# Print sales['CA':'TX']
sales3['CA':'TX']

             eggs  salt  spam
state month
CA    1        47  12.0    17
      2       110  50.0    31
NY    1       221  89.0    72
      2        77  87.0    20
TX    1       132   NaN    52
      2       205  60.0    55

### Using .loc[] with nonunique indexes

- it is always preferable to have a meaningful index that uniquely identifies each row. 
- Even though pandas does not require unique index values in DataFrames, it works better if the index values are indeed unique.

In [182]:
# Set the index to the column 'state': sales
sales2 = sales.set_index(['state'])

# Print the sales DataFrame
print(sales2)

       month  eggs  salt  spam
state
CA         1    47  12.0    17
CA         2   110  50.0    31
NY         1   221  89.0    72
NY         2    77  87.0    20
TX         1   132   NaN    52
TX         2   205  60.0    55

In [183]:
# Access the data from 'NY'
print(sales2.loc['NY'])

       month  eggs  salt  spam
state
NY         1   221  89.0    72
NY         2    77  87.0    20

### Indexing multiple levels of a MultiIndex

- lookups based on the outermost level of a MultiIndex work just like lookups on DataFrames that have a single-level Index.
- Looking up data based on inner levels of a MultiIndex can be a bit trickier. 
 - The trickiest of all these lookups are when you want to access some inner levels of the index. 
 - In this case, you need to use slice(None) in the slicing parameter for the outermost dimension(s) instead of the usual :, 
 - or use pd.IndexSlice.

In [193]:
# Look up data for NY in month 1: NY_month1
NY_month1 = sales3.loc[('NY',1),:]
NY_month1

eggs    221.0
salt     89.0
spam     72.0
Name: (NY, 1), dtype: float64

In [194]:
# Look up data for CA and TX in month 2: CA_TX_month2
CA_TX_month2 = sales3.loc[(['CA','TX'],2),:]
CA_TX_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
TX    2       205  60.0    55

In [195]:
# Look up data for all states in month 2: all_month2
all_month2 = sales3.loc[(slice(None), 2),:]
all_month2

             eggs  salt  spam
state month
CA    2       110  50.0    31
NY    2        77  87.0    20
TX    2       205  60.0    55

# Rearranging and reshaping data

## Pivoting DataFrames

#### Clinical trials data

In [196]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/trials_01.csv'
trials = pd.read_csv(file)
trials.head()

   id treatment gender  response
0   1         A      F         5
1   2         A      M         3
2   3         B      F         8
3   4         B      M         9

#### Reshaping by pivoting

In [197]:
trials.pivot(
  index = 'treatment',
  columns = 'gender',
  values = 'response')

gender     F  M
treatment
A          5  3
B          8  9

#### Pivoting multiple columns
- if you don't specify the values column it will use all remaining columns
- the resulting datafraem will have multi index columns

In [199]:
trials.pivot(
  index = 'treatment',
  columns = 'gender')

          id    response
gender     F  M        F  M
treatment
A          1  2        5  3
B          3  4        8  9

### Pivoting and the index

- you do not need to set the index before pivoting

#### Load the users data

In [228]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/users.csv'
users = pd.read_csv(file, index_col=0)
users.head()

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

### Pivoting a single variable

In [229]:
# Pivot the users DataFrame: visitors_pivot
visitors_pivot = users.pivot(
    index = 'weekday',
    columns = 'city',
    values = 'visitors')

# Print the pivoted DataFrame
visitors_pivot

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

### Pivoting all variables

In [230]:
# Pivot users with signups indexed by weekday and city: signups_pivot
signups_pivot = users.pivot(
    index = 'weekday',
    columns = 'city',
    values = 'signups')

# Print signups_pivot
signups_pivot

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [231]:
# Pivot users pivoted by both signups and visitors: pivot
pivot = users.pivot(
    index = 'weekday',
    columns = 'city')

# Print the pivoted DataFrame
pivot

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

## Stacking & unstacking DataFrames

#### Creating a multi-level index
- pivoting wont work when there is a multi-level index. hmmmm

In [207]:
trials

   id treatment gender  response
0   1         A      F         5
1   2         A      M         3
2   3         B      F         8
3   4         B      M         9

In [208]:
trials = trials.set_index(['treatment','gender'])
trials

                  id  response
treatment gender
A         F        1         5
          M        2         3
B         F        3         8
          M        4         9

#### Unstacking a multi-level index
- this moves an index to the column level which is sorta like pivoting

In [209]:
trials.unstack(level = 'gender')

          id    response
gender     F  M        F  M
treatment
A          1  2        5  3
B          3  4        8  9

In [210]:
trials.unstack(level=1)

          id    response
gender     F  M        F  M
treatment
A          1  2        5  3
B          3  4        8  9

#### Stacking DataFrames
- conversely, with stack, you specify a level of the hierarcical columns to be moved to the index

In [214]:
trials_by_gender = trials.unstack(level = 'gender')
trials_by_gender

          id    response
gender     F  M        F  M
treatment
A          1  2        5  3
B          3  4        8  9

In [217]:
stacked = trials_by_gender.stack(level='gender')
stacked

                  id  response
treatment gender
A         F        1         5
          M        2         3
B         F        3         8
          M        4         9

#### Swapping levels

In [219]:
swapped = stacked.swaplevel(0,1)
swapped

                  id  response
gender treatment
F      A           1         5
M      A           2         3
F      B           3         8
M      B           4         9

#### Sorting rows

In [220]:
sorted_trials = swapped.sort_index()
sorted_trials

                  id  response
gender treatment
F      A           1         5
       B           3         8
M      A           2         3
       B           4         9

### Stacking & unstacking I

In [234]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/users.csv'
users = pd.read_csv(file, index_col=0)
users = users.set_index(['city','weekday']).sort_index()
users.head()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [235]:
# Unstack users by 'weekday': byweekday
byweekday = users.unstack(level = 'weekday')

# Print the byweekday DataFrame
byweekday

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [236]:
# Stack byweekday by 'weekday' and print it
byweekday.stack(level = 'weekday')

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

### Stacking & unstacking II

In [237]:
# Unstack users by 'city': bycity
bycity = users.unstack(level = 'city')

# Print the bycity DataFrame
bycity

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [238]:
# Stack bycity by 'city' and print it
bycity.stack(level='city')

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

### Restoring the index order

In [240]:
# Stack 'city' back into the index of bycity: newusers
newusers = bycity.stack(level = 'city')

# Swap the levels of the index of newusers: newusers
newusers = newusers.swaplevel(0,1)

# Print newusers and verify that the index is not sorted
newusers

                visitors  signups
city   weekday
Austin Mon           326        3
Dallas Mon           456        5
Austin Sun           139        7
Dallas Sun           237       12

In [241]:
# Sort the index of newusers: newusers
newusers = newusers.sort_index()

# Print newusers and verify that the index is now sorted
newusers

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [242]:
# Verify that the new DataFrame is equal to the original
newusers.equals(users)

True

## Melting DataFrames

- The goal of melting is to restore a pivoted DataFrame to its original form, or to change it from a wide shape to a long shape.

#### Clinical trials data

In [243]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/trials_02.csv'
new_trials = pd.read_csv(file)
new_trials

  treatment  F  M
0         A  5  3
1         B  8  9

#### Specifiying id_vars
- we need to specify the variable that we want to remain in the dataframe

In [246]:
pd.melt(new_trials, id_vars = ['treatment'])

  treatment variable  value
0         A        F      5
1         B        F      8
2         A        M      3
3         B        M      9

#### Specifying value_vars

In [247]:
pd.melt(new_trials, 
        id_vars = ['treatment'],
        value_vars = ['F','M'])

  treatment variable  value
0         A        F      5
1         B        F      8
2         A        M      3
3         B        M      9

#### Specifying value_name

In [248]:
pd.melt(new_trials, 
        id_vars = ['treatment'],
        var_name = 'gender',
        value_name = 'response')

  treatment gender  response
0         A      F         5
1         B      F         8
2         A      M         3
3         B      M         9

### Adding names for readability

#### First I need to build the same data set they have

In [252]:
users

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [255]:
users2 = users.reset_index()
users2

     city weekday  visitors  signups
0  Austin     Mon       326        3
1  Austin     Sun       139        7
2  Dallas     Mon       456        5
3  Dallas     Sun       237       12

In [256]:
visitors_by_city_weekday = users2.pivot(
    index = 'weekday',
    columns = 'city',
    values = 'visitors')

visitors_by_city_weekday

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

#### Exercise

In [258]:
# Reset the index: visitors_by_city_weekday
visitors_by_city_weekday = visitors_by_city_weekday.reset_index()

# Print visitors_by_city_weekday
visitors_by_city_weekday

city weekday  Austin  Dallas
0        Mon     326     456
1        Sun     139     237

In [259]:
# Melt visitors_by_city_weekday: visitors
visitors = pd.melt(visitors_by_city_weekday, id_vars='weekday', value_name='visitors')

# Print visitors
visitors

  weekday    city  visitors
0     Mon  Austin       326
1     Sun  Austin       139
2     Mon  Dallas       456
3     Sun  Dallas       237

### Going from wide to long

In [260]:
# Melt users: skinny
skinny = pd.melt(users2, 
  id_vars = ['weekday', 'city'],
  value_vars = ['visitors','signups'])

# Print skinny
skinny

  weekday    city  variable  value
0     Mon  Austin  visitors    326
1     Sun  Austin  visitors    139
2     Mon  Dallas  visitors    456
3     Sun  Dallas  visitors    237
4     Mon  Austin   signups      3
5     Sun  Austin   signups      7
6     Mon  Dallas   signups      5
7     Sun  Dallas   signups     12

### Obtaining key-value pairs with melt()
- hmm, I don't like how this looses data, but I guess its a good example of what can happen

In [261]:
# Set the new index: users_idx
users_idx = users2.set_index(['city','weekday'])

# Print the users_idx DataFrame
users_idx

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [262]:
# Obtain the key-value pairs: kv_pairs
kv_pairs = pd.melt(users_idx, col_level=0)

# Print the key-value pairs
kv_pairs

   variable  value
0  visitors    326
1  visitors    139
2  visitors    456
3  visitors    237
4   signups      3
5   signups      7
6   signups      5
7   signups     12

## Pivot tables

- Pivoting does not always work
- Pivoting requires unique index column pairs to identify values in the new table

#### More clinical trials data
- Notice that we have repeated pairs of treatment and gender

In [263]:
file = 'https://assets.datacamp.com/production/course_1650/datasets/trials_03.csv'
more_trials = pd.read_csv(file)
more_trials.head()

   id treatment gender  response
0   1         A      F         5
1   2         A      M         3
2   3         A      M         8
3   4         A      F         9
4   5         B      F         1

#### Rearranging by pivoting
- This will fail

In [264]:
more_trials.pivot(
 index = 'treatment',
 columns = 'gender',
 values = 'response')

ValueError: Index contains duplicate entries, cannot reshape

#### Pivot table
- The pivot table method reshapes a data frame, much like pivot, by summarizing the data frame with a pair of summarizing variables and their values
- pivot tables deal with multiple values for the same index column pair by using a reduction
 - by default the reduction is an average

In [265]:
more_trials.pivot_table(
  index = 'treatment',
  columns = 'gender',
  values = 'response')

gender            F    M
treatment
A          7.000000  5.5
B          3.666667  8.0

#### Other aggregations
- use the keyword `aggfunc`

In [266]:
more_trials.pivot_table(
  index = 'treatment',
  columns = 'gender',
  values = 'response',
  aggfunc = 'count')

gender     F  M
treatment
A          2  2
B          3  1

### Setting up a pivot table

In [268]:
users2

     city weekday  visitors  signups
0  Austin     Mon       326        3
1  Austin     Sun       139        7
2  Dallas     Mon       456        5
3  Dallas     Sun       237       12

In [269]:
# Create the DataFrame with the appropriate pivot table: by_city_day
by_city_day = users.pivot_table(
    index = 'weekday',
    columns = 'city')

# Print by_city_day
by_city_day

        signups        visitors
city     Austin Dallas   Austin Dallas
weekday
Mon           3      5      326    456
Sun           7     12      139    237

### Using other aggregations in pivot tables

In [270]:
# Use a pivot table to display the count of each column: count_by_weekday1
count_by_weekday1 = users.pivot_table(
    index = 'weekday',
    aggfunc = 'count')

# Print count_by_weekday
count_by_weekday1

         signups  visitors
weekday
Mon            2         2
Sun            2         2

In [271]:
# Replace 'aggfunc='count'' with 'aggfunc=len': count_by_weekday2
count_by_weekday2 = users.pivot_table(
    index = 'weekday',
    aggfunc = len)

count_by_weekday2

         signups  visitors
weekday
Mon            2         2
Sun            2         2

In [272]:
# Verify that the same result is obtained
print('==========================================')
print(count_by_weekday1.equals(count_by_weekday2))

==========================================
True

### Using margins in pivot tables

In [273]:
# Create the DataFrame with the appropriate pivot table: signups_and_visitors
signups_and_visitors = users.pivot_table(
    index = 'weekday',
    aggfunc = sum)

# Print signups_and_visitors
signups_and_visitors

         signups  visitors
weekday
Mon            8       782
Sun           19       376

In [274]:
# Add in the margins: signups_and_visitors_total 
signups_and_visitors_total = users.pivot_table(
    index = 'weekday',
    aggfunc = sum,
    margins = True)

# Print signups_and_visitors_total
signups_and_visitors_total

         signups  visitors
weekday
Mon          8.0     782.0
Sun         19.0     376.0
All         27.0    1158.0

# Grouping data

## Categoricals and groupby

### Advantages of categorical data types

### Grouping by multiple columns

### Grouping by another series

## Groupby and aggregation

### Computing multiple aggregates of multiple columns

### Aggregating on index levels/fields

### Grouping on a function of the index

## Groupby and transformation

### Detecting outliers with Z-Scores

### Filling missing data (imputation) by group

### Other transformations with .apply

## Groupby and filtering

### Grouping and filtering with .apply()

### Grouping and filtering with .filter()

### Filtering and grouping with .map()

# Brining it all together

## Case Study - Summer Olympics

### Grouping and aggregating

### Using .value_counts() for ranking

### Using .pivot_table() to count medals by type

## Understanding the column labels

### Applying .drop_duplicates()

### Finding possible errors with .groupby()

### Locating suspicious data

## Constructing alternative country rankings

### Using .nunique() to rank by distinct sports

### Counting USA vs. USSR Cold War Olympic Sports

### Counting USA vs. USSR Cold War Olympic Medals

## Reshaping DataFrames for visualization

### Visualizing USA Medal Counts by Edition: Line Plot

### Visualizing USA Medal Counts by Edition: Area Plot

### Visualizing USA Medal Counts by Edition: Area Plot with Ordered Medals

## Congratulations!